# Lista de Exercício 01

### Exercício 1: Importe a biblioteca pandas para o projeto.

In [1]:
import pandas as pd

### Exercício 2: Importe o conjunto de dados **casa_para_venda** no arquivo CSV em anexo e armazene em um pandas DataFrame.

In [3]:
df = pd.read_csv("casa_para_venda.csv")

### Exercício 3: Inspecione o dataframe usando print().

In [ ]:
print(df)

                 city  area  ...  fire insurance (R$)  total (R$)
0           São Paulo    70  ...                   42        5618
1           São Paulo   320  ...                   63        7973
2        Porto Alegre    80  ...                   41        3841
3        Porto Alegre    51  ...                   17        1421
4           São Paulo    25  ...                   11         836
...               ...   ...  ...                  ...         ...
10687    Porto Alegre    63  ...                   22        1926
10688       São Paulo   285  ...                  191       19260
10689  Rio de Janeiro    70  ...                   78        7390
10690  Rio de Janeiro   120  ...                  155       14020
10691       São Paulo    80  ...                   22        1587

[10692 rows x 13 columns]

### Exercício 4: Inspecione as 10 primeiras linhas do DataFrame.

In [ ]:
df.head(10)

             city  area  ...  fire insurance (R$)  total (R$)
0       São Paulo    70  ...                   42        5618
1       São Paulo   320  ...                   63        7973
2    Porto Alegre    80  ...                   41        3841
3    Porto Alegre    51  ...                   17        1421
4       São Paulo    25  ...                   11         836
5       São Paulo   376  ...                  121        8955
6  Rio de Janeiro    72  ...                   25        2750
7       São Paulo   213  ...                   41        7253
8       São Paulo   152  ...                  191       16440
9  Rio de Janeiro    35  ...                   30        2955

[10 rows x 13 columns]

### Exercício 5: Inspecione as 5 últimas linhas do DataFrame.

In [ ]:
df.tail()

                 city  area  ...  fire insurance (R$)  total (R$)
10687    Porto Alegre    63  ...                   22        1926
10688       São Paulo   285  ...                  191       19260
10689  Rio de Janeiro    70  ...                   78        7390
10690  Rio de Janeiro   120  ...                  155       14020
10691       São Paulo    80  ...                   22        1587

[5 rows x 13 columns]

### Exercício 6: Obtenha algumas meta informações do Dataframe. Quais e quantas colunas? Qual tipo? Existem dados faltantes?

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10692 entries, 0 to 10691
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   city                 10692 non-null  object
 1   area                 10692 non-null  int64
 2   rooms                10692 non-null  int64
 3   bathroom             10692 non-null  int64
 4   parking spaces       10692 non-null  int64
 5   floor                10692 non-null  object
 6   animal               10692 non-null  object
 7   furniture            10692 non-null  object
 8   hoa (R$)             10692 non-null  int64
 9   rent amount (R$)     10692 non-null  int64
 10  property tax (R$)    10692 non-null  int64
 11  fire insurance (R$)  10692 non-null  int64
 12  total (R$)           10692 non-null  int64
dtypes: int64(9), object(4)
memory usage: 1.1+ MB

### Exercício 7: Obtenha algumas inforamações estatísticas resumidas do Dataframe. Qual valor mais caro do condomínio? E do aluguel?

In [ ]:
df.describe(include="O")

             city  floor animal      furniture
count       10692  10692  10692          10692
unique          5     35      2              2
top     São Paulo      -  acept  not furnished
freq         5887   2461   8316           8086

In [ ]:
df.describe()

               area         rooms  ...  fire insurance (R$)    total (R$)
count  10692.000000  10692.000000  ...         10692.000000  1.069200e+04
mean     149.217920      2.506079  ...            53.300879  5.490487e+03
std      537.016942      1.171266  ...            47.768031  1.648473e+04
min       11.000000      1.000000  ...             3.000000  4.990000e+02
25%       56.000000      2.000000  ...            21.000000  2.061750e+03
50%       90.000000      2.000000  ...            36.000000  3.581500e+03
75%      182.000000      3.000000  ...            68.000000  6.768000e+03
max    46335.000000     13.000000  ...           677.000000  1.120000e+06

[8 rows x 9 columns]

### Exercício 8: Selecione a coluna "city" usando a notação de atributo (ponto).

In [4]:
df.city

0             São Paulo
1             São Paulo
2          Porto Alegre
3          Porto Alegre
4             São Paulo
              ...
10687      Porto Alegre
10688         São Paulo
10689    Rio de Janeiro
10690    Rio de Janeiro
10691         São Paulo
Name: city, Length: 10692, dtype: object

### Exercício 9: Qual o nome da cidade no index\LINHA 35?

In [6]:
df.iloc[35]

city                    Porto Alegre
area                              38
rooms                              1
bathroom                           1
parking spaces                     2
floor                             11
animal                     not acept
furniture              not furnished
hoa (R$)                         450
rent amount (R$)                1750
property tax (R$)                  0
fire insurance (R$)               26
total (R$)                      2226
Name: 35, dtype: object

### Exercício 10: Selecione a coluna "rent amount"

In [ ]:
df["rent amount (R$)"]

0         3300
1         4960
2         2800
3         1112
4          800
         ...
10687     1478
10688    15000
10689     6000
10690    12000
10691     1400
Name: rent amount (R$), Length: 10692, dtype: int64

### Exercício 11: Selecione a cidade no índice 100 usando o operador iloc (todas as colunas)! Qual o valor do aluguel?

In [ ]:
df.iloc[100]

city                    Porto Alegre
area                              50
rooms                              1
bathroom                           1
parking spaces                     1
floor                              1
animal                         acept
furniture              not furnished
hoa (R$)                         350
rent amount (R$)                 950
property tax (R$)                 50
fire insurance (R$)               14
total (R$)                      1364
Name: 100, dtype: object

### Exercício 12: Selecione a cidade no índice 123 usando o operador iloc (todas as colunas)! Quantos quartos tem?

In [ ]:
df.iloc[123]

city                       São Paulo
area                              94
rooms                              3
bathroom                           2
parking spaces                     2
floor                              1
animal                         acept
furniture              not furnished
hoa (R$)                        1337
rent amount (R$)                3570
property tax (R$)                140
fire insurance (R$)               46
total (R$)                      5093
Name: 123, dtype: object

### Exercício 13: Selecione as últimas 8 linhas e as colunas; area, rooms, bathroom, floor. Usando o operador iloc. Qual o menor valor do aluguel?

In [7]:
# -8 Linhas no final da tabela & Colunas -> [1, 2, 3, 5, 9]
df2 = df.iloc[-8:, [1, 2, 3, 5, 9]]

In [31]:
display(df2)

       area  rooms  bathroom floor  rent amount (R$)
10684    98      2         1     1              3900
10685    83      3         2    11              7521
10686   150      3         3     8             13500
10687    63      2         1     5              1478
10688   285      4         4    17             15000
10689    70      3         3     8              6000
10690   120      2         2     8             12000
10691    80      2         1     -              1400

In [34]:
# VALOR MINIMO DA COLUNA ESPECIFICADA:
df2["rent amount (R$)"].min()

1400

In [30]:
display(df2.T)

                 10684 10685  10686 10687  10688 10689  10690 10691
area                98    83    150    63    285    70    120    80
rooms                2     3      3     2      4     3      2     2
bathroom             1     2      3     1      4     3      2     1
floor                1    11      8     5     17     8      8     -
rent amount (R$)  3900  7521  13500  1478  15000  6000  12000  1400

In [8]:
# MENOR VALOR NA LINHA DE APENAS A ULTIMA COLUNA:
df2["rent amount (R$)"].min()

1400

In [18]:
# MENOR VALOR DA ULTIMA COLUNA DE TODAS AS LINHAS:
df2.iloc[[-1]].min()

area                  80
rooms                  2
bathroom               1
floor                  -
rent amount (R$)    1400
dtype: object

### Exercício 14: Importe o conjunto de dados casa_para_venda e defina a coluna city como index!

In [41]:
# PEGA APENAS A COLUNA CIDADE:
df.city.T

0             São Paulo
1             São Paulo
2          Porto Alegre
3          Porto Alegre
4             São Paulo
              ...
10687      Porto Alegre
10688         São Paulo
10689    Rio de Janeiro
10690    Rio de Janeiro
10691         São Paulo
Name: city, Length: 10692, dtype: object

In [38]:
df3 = pd.read_csv("casa_para_venda.csv", index_col="city")

In [39]:
df3.head()

,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
city,,,,,,,,,,,,
São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841
Porto Alegre,51,2,1,0,2,acept,not furnished,270,1112,22,17,1421
São Paulo,25,1,1,0,1,not acept,not furnished,0,800,25,11,836

### Exercício 15: Inspecione o Dataframe

In [28]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10692 entries, São Paulo to São Paulo
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   area                 10692 non-null  int64
 1   rooms                10692 non-null  int64
 2   bathroom             10692 non-null  int64
 3   parking spaces       10692 non-null  int64
 4   floor                10692 non-null  object
 5   animal               10692 non-null  object
 6   furniture            10692 non-null  object
 7   hoa (R$)             10692 non-null  int64
 8   rent amount (R$)     10692 non-null  int64
 9   property tax (R$)    10692 non-null  int64
 10  fire insurance (R$)  10692 non-null  int64
 11  total (R$)           10692 non-null  int64
dtypes: int64(9), object(3)
memory usage: 1.1+ MB

### Exercício 16: Selecione a linha com o rótulo de index "Campinas" (usando o operador loc)! Qual foi a saída?

In [ ]:
df3.loc["Campinas"]

          area  rooms  ...  fire insurance (R$)  total (R$)
city                   ...
Campinas    46      1  ...                    8        1181
Campinas   330      4  ...                  121        9129
Campinas   208      3  ...                   48        3328
Campinas   250      3  ...                   22        4178
Campinas    48      1  ...                   21        2185
...        ...    ...  ...                  ...         ...
Campinas    92      3  ...                   22        2669
Campinas    83      2  ...                   47        4781
Campinas   140      1  ...                   66        7012
Campinas   150      3  ...                   53        3739
Campinas   250      1  ...                   34        2836

[853 rows x 12 columns]

### Exercício 17: Renomeie a coluna **city** para **cidade**

In [49]:
df.rename(columns={"city": "cidade"}, inplace=True)

In [50]:
df.columns

Index(['cidade', 'area', 'rooms', 'bathroom', 'parking spaces', 'floor',
       'animal', 'furniture', 'hoa (R$)', 'rent amount (R$)',
       'property tax (R$)', 'fire insurance (R$)', 'total (R$)'],
      dtype='object')

### Exercício 18: Verifique se todas as observações na coluna "cidade" são iguais a "São Paulo". Salve a reposta em uma variável.

In [51]:
# CHECA SE TODAS AS OCORRENCIAS NA COLUNA 'CIDADE' SÃO == 'SÃO PAULO':
(df["cidade"] == "São Paulo").all()

False

In [52]:
# QUANTIDADE DE OCORRENCIAS DE SÃO PAULO NA COLUNA 'CIDADE'
quant = 0
for f in df['cidade']:
    if f == 'São Paulo':
        quant +=1
print(quant)

5887

### Exercício 19: Remova a coluna "furniture" do conjunto de dados.

In [ ]:
df.drop('furniture', axis=1, inplace=True)

In [ ]:
df.columns

Index(['cidade', 'area', 'rooms', 'bathroom', 'parking spaces', 'floor',
       'animal', 'hoa (R$)', 'rent amount (R$)', 'property tax (R$)',
       'fire insurance (R$)', 'total (R$)'],
      dtype='object')

### Exercício 20: Crie uma matriz de correlação para o DataFrame.

In [ ]:
df.corr()

                         area     rooms  ...  fire insurance (R$)  total (R$)
area                 1.000000  0.193796  ...             0.188078    0.051799
rooms                0.193796  1.000000  ...             0.565148    0.134597
bathroom             0.226766  0.733763  ...             0.676399    0.208339
parking spaces       0.193983  0.617510  ...             0.597348    0.148684
hoa (R$)             0.006890  0.007139  ...             0.029535    0.955024
rent amount (R$)     0.180742  0.541758  ...             0.987343    0.264490
property tax (R$)    0.039059  0.075252  ...             0.105661    0.218344
fire insurance (R$)  0.188078  0.565148  ...             1.000000    0.254911
total (R$)           0.051799  0.134597  ...             0.254911    1.000000

[9 rows x 9 columns]

In [42]:
# ILOC  ->  NUMEROS / POSIÇÕES
# LOC   ->  STRINGS

In [59]:
#print(df.iloc[0].T)
df

,cidade,area,rooms,bathroom,parking spaces,floor,animal,furniture,hoa (R$),rent amount (R$),property tax (R$),fire insurance (R$),total (R$)
0,São Paulo,70,2,1,1,7,acept,furnished,2065,3300,211,42,5618
1,São Paulo,320,4,4,0,20,acept,not furnished,1200,4960,1750,63,7973
2,Porto Alegre,80,1,1,1,6,acept,not furnished,1000,2800,0,41,3841
3,Porto Alegre,51,2,1,0,2,acept,not furnished,270,1112,22,17,1421
4,São Paulo,25,1,1,0,1,not acept,not furnished,0,800,25,11,836
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10687,Porto Alegre,63,2,1,1,5,not acept,furnished,402,1478,24,22,1926
10688,São Paulo,285,4,4,4,17,acept,not furnished,3100,15000,973,191,19260
10689,Rio de Janeiro,70,3,3,0,8,not acept,furnished,980,6000,332,78,7390
10690,Rio de Janeiro,120,2,2,2,8,acept,furnished,1585,12000,279,155,14020
10691,São Paulo,80,2,1,0,-,acept,not furnished,0,1400,165,22,1587